<a href="https://colab.research.google.com/github/vishnuvardhan-jadava/pandas_basics_practice/blob/main/pandas_basics_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:
import pandas as pd
import numpy as np

In [4]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [5]:
data

{'age': [3.5, 4, 1.5, nan, 6, 3, 5.5, nan, 8, 4],
 'birds': ['Cranes',
  'Cranes',
  'plovers',
  'spoonbills',
  'spoonbills',
  'Cranes',
  'plovers',
  'Cranes',
  'spoonbills',
  'spoonbills'],
 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],
 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2]}

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [6]:
birds = pd.DataFrame(data)
birds

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [9]:
birds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

**3. Print the first 2 rows of the birds dataframe **

In [30]:
birds.head(2)
#birds.iloc[[1,2]]

    birds  age  visits priority
0  Cranes  3.5       2      yes
1  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [20]:
birds[['birds','age']]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [24]:
birds[['birds','age','visits']].iloc[[2,3,7]]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [31]:
birds[birds['visits']<4]

        birds  age  visits priority
0      Cranes  3.5       2      yes
2     plovers  1.5       3       no
4  spoonbills  6.0       3       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [37]:
birds[birds['age'].isna()][['birds', 'visits']]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [57]:
birds[(birds['birds']=='Cranes') & (birds['age']<4)]

    birds  age  visits priority
0  Cranes  3.5       2      yes
5  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [60]:
birds[(birds['age'] >=2) & (birds['age'] <=4)]

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
9  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [67]:
birds[birds['birds']=='Cranes']['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [74]:
birds.groupby('birds')['age'].mean()

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [88]:
birds['k'] = birds['age']*2

In [89]:
birds.drop(['k'],axis=1,inplace=True)

**13. Find the number of each type of birds in dataframe (Counts)**

In [90]:
birds['birds'].value_counts()

spoonbills    4
Cranes        4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [105]:
age_asc = birds.sort_values(['age'],ascending=False)
age_asc.sort_values(['visits'])

        birds  age  visits priority
6     plovers  5.5       2       no
9  spoonbills  4.0       2       no
0      Cranes  3.5       2      yes
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
4  spoonbills  6.0       3       no
2     plovers  1.5       3       no
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
3  spoonbills  NaN       4      yes



```
# This is formatted as code
```

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [109]:
birds['priority'].replace(to_replace=('yes','no'), value=(1,0),inplace=True)
birds

        birds  age  visits  priority
0      Cranes  3.5       2         1
1      Cranes  4.0       4         1
2     plovers  1.5       3         0
3  spoonbills  NaN       4         1
4  spoonbills  6.0       3         0
5      Cranes  3.0       4         0
6     plovers  5.5       2         0
7      Cranes  NaN       2         1
8  spoonbills  8.0       3         0
9  spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [111]:
birds['birds'].replace('Cranes','trumpeters',inplace=True)
birds